In [ ]:
import mysql.connector

database=mysql.connector.connect(
    host="localhost",
    user="root",
    password="",)= 
  database = "database name e.g test"
)
db = database.cursor()

In [ ]:
#reading from database
#sql = "SELECT * FROM student"
#db.execute(sql) or 

db.execute("SELECT * table name")
result = db.fectchall()
for x in result:
    print(x)

In [ ]:
#select
data = []
db.execute("SELECT * table name")
db.execute(sql)
result = db.fectchall()
for x in result:
    data.append(x)
data

In [ ]:
#insert data in database
sql = '''INSERT INTO student (name,physics,chemistry,math,total)
VALUES('Nabin',89,98,78,23,300)'''
db.excute(sql)
database.commit() # change in database

In [ ]:
# for single user input
name = input("Enter name = ")
physics = int(input("Enter physics marks = "))
chemistry = int(input("Enter chemistry marks = "))
math = int(input("Enter math marks = "))
total = physics + chemistry + math
sql = f"INSERT INTO student (name,physics,chemistry,math,toal) VALUE('{name},{physics},{chemistry},{math},{total}')"
db.execute(sql)
database.commit()

In [ ]:
#for multiple user input data
n = int(input("Enter the number = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics marks = "))
    chemistry = int(input("Enter chemistry marks = "))
    math = int(input("Enter math marks = "))
    total = physics + chemistry + math
    sql = f"INSERT INTO student (name,physics,chemistry,math,toal) VALUE('{name}',{physics},{chemistry},{math},{total})"
    db.execute(sql)
database.commit()
#'{name}' -- string

In [ ]:
#update user information using python 
sql = "UPDATE  *table name* SET name = 'Rose' WHERE sn = 3"
db.execute(sql)
database.commit()

In [ ]:
# user input
name = input("Enter your name: ")
sn = int(input("Enter SN: "))
sql = f"UPDATE *table name* SET name = '{name}' WHERE sn = {sn}"
db.execute(sql)
database.commit()

In [ ]:
#delete  operation 
# user input
name = input("Enter your name: ")
sn = int(input("Enter SN: "))
sql = f"DELETE *table name* SET name = '{name}' WHERE sn = {sn}"
db.execute(sql)
database.commit()

In [ ]:
#sql = "DELETE from student WHERE sn = 1"
#db.execute(sql)
#database.commit()

In [ ]:
#wap input from user 1 for insert 2 for select 3 for update 4 for delete